# str = ''' Гравітаційні хвилі – періодичні коливання у структурі простору-часу. Існування гравітаційних хвиль було передбачене Альбертом Ейнштейном у загальній теорії відносності, але це було єдине передбачення теорії, яке не мало експериментального підтвердження. Детектування гравітаційних хвиль ускладнюють технічні проблеми, оскільки гравітаційне випромінювання надзвичайно слабке. 11 лютого 2016 р. учасники проекту LIGO (Advanced Laser Interferometer Gravitational-Wave Observatory) оголосили про експериментальне відкриття гравітаційних хвиль. Уперше гравітаційні хвилі було виявлено відразу на двох детекторах LIGO 14 вересня 2015 р. Сигнал походив від злиття двох чорних дір масами 36 і 29 сонячних мас, яке відбулося на відстані близько 1,3 млрд світлових років від Землі. У червні 2016 р. стало відомо про другий випадок реєстрації гравітаційних хвиль на детекторах LIGO. Це сталося 26 грудня 2015 р. під час циклу досліджень, що розпочався 30 листопада 2015 р. На відміну від першого сигналу, який було чітко видно на фоні завад, другий сигнал виявився слабкішим і не таким явним. Втретє детектори LIGO зафіксували гравітаційні хвилі 4 січня 2017 р. Як і в попередніх випадках, хвилі утворилися внаслідок злиття чорних дір на відстані близько 3 млрд світлових років, у результаті чого утворилася нова чорна діра з масою, яка еквівалентна приблизно 49 масам Сонця. Вчетверте гравітаційні хвилі було зареєстровано 14 серпня 2017 р., причому до спостережень приєднався європейський гравітаційно-хвильовий детектор Virgo [1]. Лідери міжнародної колаборації LIGO, американські вчені Райнер Вайс, Баррі Беріш і Кіп Торн, стали Лауреатами Нобелівської премії з фізики 2017 р. за «вирішальний внесок у проект детектора LIGO та спостереження гравітаційних хвиль» [1]. Значний внесок у дослідження гравітаційних хвиль зробив ще у 1962 р. радянський фізик українського походження В. І. Пустовойт, який разом зі своїм колегою М. Є. Герценштейном у статті «До питання про виявлення гравітаційних хвиль малих частот» [2] уперше теоретично обґрунтував метод інтерферометричного детектування гравітаційних хвиль із використанням лазерного випромінювання. У науковому описі Нобелівського комітету [6] зазначено, що практична реалізація цієї ідеї призвела до створення проекту LIGO. 8 Українські вчені в 70-х роках ХХ ст. теж займалися пошуком та дослідженням гравітаційних хвиль. Над цим працювала дослідницька група Інституту теоретичної фізики АН УРСР. Засновником робіт був В. Б. Брагінський, професор Московського державного університету, співавтор статей про детектування гравітаційних хвиль та учасник наукової колаборації LIGO [5]. Керував експериментальними роботами у Києві академік АН УРСР О. З. Петров, який, окрім теоретичних досліджень гравітації, розв’язував питання експериментального обґрунтування і підтвердження загальної теорії відносності [3]. Було зібрано гравітаційно-хвильовий детектор, причому вдалося досягти високого на той час рівня точності вимірювань, проте гравітаційних хвиль зафіксувати не вдалося [5]. А. Л. Зельманов, також наш співвітчизник, є одним із засновників радянської космологічної школи. З його ім’ям пов’язано становлення та розвиток розділу науки, що отримав згодом назву математична космологія. На його працях ґрунтуються при аналізі поведінки електромагнітних та гравітаційних полів в околицях нейтронних зір та чорних дір [4]. Відкриття гравітаційних хвиль дало вченим новий спосіб спостережень Всесвіту. Тепер науковці мають змогу перевірити чисельні теорії й припущення у космології, а також більш поглиблено вивчати будову та еволюцію Всесвіту.'''
# # print(str.replace('  ', ' ').replace('\n', ' '))
# final_str = ''
# count = 4
# for elem in range(len(str)):
#     if str[elem] == '[':
#         count -= 1
#     if count != 4:
#         count -= 1
#     if count == 4:
#         final_str += str[elem]
#     if count == 0:
#         count = 3
#
# print(final_str)

# file = open("1.docx", 'w')
# file.write("123")
# file.close()
# file = open("1.docx", 'r')
# print(file.readline())
# for line in file.readlines():
#     print(line)

